Revit 2027 API
MEPAnalyticalSystem.GetWaterLoopData Method
 Returns the water loop data, null if not available.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WaterLoopData GetWaterLoopData()
Public Function GetWaterLoopData As WaterLoopData
public:
WaterLoopData^ GetWaterLoopData()
member GetWaterLoopData : unit -> WaterLoopData
Return Value
WaterLoopData
See Also
Reference
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace